blog/03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Slight Change In Gears</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">A Slight Change In Gears</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf230a68">A call to creativity</a></li>
</ul>
</div>
</div>
<p>
So it would seem that I am shifting gears a little.
</p>

<p>
When referring to my <a href="01.html">initial</a> entry, I couldn't help but feel overwhelemed by the task at hand. I couldn't see myself dedicating vast amount of hours on every pillar of the operation I wanted to tackle (Networking, Knowledge Building, ect.) while also creating a viable social media brand.
</p>

<p>
It's just so counter to the modern media landscape that is before us, which basically includes mass publications while trying to stay in tune with the algorythms that govern the visibility and success of such media.
</p>

<p>
Essentially I'm saying that media publishing online is like a fulltime job that isn't very much at all conducive to building knowledge structures for social change. Sure, the research and compiling of such information may inform what I ought to create, but I didn't really see the utility in doing these concurrantly, at least not to start.
</p>

<p>
Of course, I could document my journey of learning, a sort of adventure towards competence and eventually towards change, but that wasn't the vision I had for the type of content I would have for the project.
</p>

<div id="outline-container-orgf230a68" class="outline-2">
<h2 id="orgf230a68">A call to creativity</h2>
<div class="outline-text-2" id="text-orgf230a68">
<p>
Along with this reluctant realization, I thought about the personal meaning it instilled in me.
</p>

<p>
If I was really to dedicate myself to soley one thing, then I would at least want to have something in it for me, and I realized that that would probably not be a fulfilling endevour for me.
</p>

<p>
I know, I haven't even really started and I am already turning away from the initial thing I wanted to do, but in way I am going back to core desire that I've pretty much had my entire life. That being that I would create narrative stories.
</p>

<p>
I want to try my hand at creative writing, and producing videos that showcase that creative writing.
</p>

<p>
This doesn't exactly match with my mission statement, but on the other hand, it could build my online precense as a creative, and maybe in the future bulster the attention I want to put on social movements and the likes.
</p>

<p>
Not to mention that this is something that I think would energize me to acutally do all that research on the side, and one day come back to it in fullforce.
</p>

<p>
I will still probably follow along my development of knowledge and ideas for social change on my <a href="https:youtube.com/@BehindRuben">personal youtube channel</a>, so I am in a way still working towards my initial goal, just in a different way.
</p>

<p>
I hope that I can soon get started on this branded endevour, as it's still something that excites me. I'll just move along in, let's say, an unofficial manner.
</p>

<p>
Thanks for reading, I'll be seeing you real soon.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-09 Fri 08:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
